import React from 'react';

const CoinIcon = () => {
  return (
    <svg
      width={24}
      height={24}
      viewBox="0 0 64 64"
      xmlns="http://www.w3.org/2000/svg"
      xmlSpace="preserve"
      fill="currentColor" // ✅ 현재 색상 적용 가능
    >
      <title>Currency Ruble</title>
      <g id="ruble">
        <g>
          <circle cx="32" cy="32" fill="#FFFFFF" r="26.5" />
          <path
            d="M58,32c0-11.868-7.996-21.897-18.881-25.001C37.462,6.675,35.752,6.5,34,6.5C19.365,6.5,7.5,18.365,7.5,33
            c0,7.773,3.348,14.765,8.679,19.612C20.565,55.987,26.051,58,32,58C46.337,58,58,46.337,58,32z"
            fill="#FFE57F"
          />
          <path
            d="M32,59C17.112,59,5,46.888,5,32S17.112,5,32,5s27,12.112,27,27S46.888,59,32,59z M32,6
            C17.663,6,6,17.663,6,32s11.663,26,26,26s26-11.663,26-26S46.337,6,32,6z"
            fill="#37474F"
          />
          <circle cx="32" cy="32" fill="#FFD740" r="22.5" />
          <path
            d="M29,48h-6v-8h-2v-4h2v-1h-2v-4h2V17h12.5c5.238,0,9.5,4.037,9.5,9s-4.262,9-9.5,9H29v1h10v4H29V48z
            M24,47h4v-8h10v-2H28v-3h7.5c4.687,0,8.5-3.589,8.5-8s-3.813-8-8.5-8H24v14h-2v2h2v3h-2v2h2V47z M34.5,32H28V20h6.5
            c3.584,0,6.5,2.691,6.5,6S38.084,32,34.5,32z M29,31h5.5c3.033,0,5.5-2.243,5.5-5s-2.467-5-5.5-5H29V31z"
            fill="#37474F"
          />
        </g>
      </g>
    </svg>
  );
};

export default CoinIcon;
